<template>
  <histogram :data="chartData"/>
</template>

<script>
import histogram from 'v-charts/lib/histogram.common'
export default {
  components: { histogram },
  data() {
    return {
      chartData: {
        columns: ['机房', '系统1', '系统12', '系统2', '系统3'],
        rows: [
          { '机房': '机房1', '系统1': 1393, '系统12': 1093, '系统2': 1093, '系统3': 2232 },
          { '机房': '机房2', '系统1': 3530, '系统12': 1230, '系统2': 3230, '系统3': 1126 },
          { '机房': '机房3', '系统1': 2923, '系统12': 1623, '系统2': 2623, '系统3': 1176 },
          { '机房': '机房4', '系统1': 1723, '系统12': 1423, '系统2': 1423, '系统3': 1149 },
          { '机房': '机房5', '系统1': 3792, '系统12': 1492, '系统2': 3492, '系统3': 10323 },
          { '机房': '机房6', '系统1': 4593, '系统12': 1293, '系统2': 4293, '系统3': 978 }
        ] }
    }
  }
}
</script>
